In [2]:
import numpy as np
import pandas as pd

In [7]:
data_sample=[[50,60,47],[70,73,75],[10,400,34],[60,5]]
data1=pd.DataFrame(data_sample,columns=['Python','C++','Java'])
print(data1)

   Python  C++  Java
0      50   60  47.0
1      70   73  75.0
2      10  400  34.0
3      60    5   NaN

In [14]:
data_dict={
    'col1':['name1','name2','name3','name4'],
    'col2':[100,90,120,80],
    'col3':[80,70,100,50],
    'col4':[10,7,14,2]
}
students=pd.DataFrame(data_dict)
print(students)
print()
students.set_index('col1',inplace=True)
print(students)

    col1  col2  col3  col4
0  name1   100    80    10
1  name2    90    70     7
2  name3   120   100    14
3  name4    80    50     2

       col2  col3  col4
col1
name1   100    80    10
name2    90    70     7
name3   120   100    14
name4    80    50     2

In [3]:
titanic=pd.read_csv("Titanic Dataset.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [17]:
print(titanic.shape)

(418, 12)

In [4]:
weather=pd.read_csv("austin_weather.csv")
print(weather)

            Date  TempHighF  TempAvgF  TempLowF DewPointHighF DewPointAvgF  \
0     2013-12-21         74        60        45            67           49
1     2013-12-22         56        48        39            43           36
2     2013-12-23         58        45        32            31           27
3     2013-12-24         61        46        31            36           28
4     2013-12-25         58        50        41            44           40
...          ...        ...       ...       ...           ...          ...
1314  2017-07-27        103        89        75            71           67
1315  2017-07-28        105        91        76            71           64
1316  2017-07-29        107        92        77            72           64
1317  2017-07-30        106        93        79            70           68
1318  2017-07-31         99        88        77            66           61

     DewPointLowF HumidityHighPercent HumidityAvgPercent HumidityLowPercent  \
0              43                  93                 75                 57
1              28                  93                 68                 43
2              23                  76                 52                 27
3              21                  89                 56                 22
4              36                  86                 71                 56
...           ...                 ...                ...                ...
1314           61                  82                 54                 25
1315           55                  87                 54                 20
1316           55                  82                 51                 19
1317           63                  69                 48                 27
1318           54                  64                 43                 22

      ... SeaLevelPressureAvgInches SeaLevelPressureLowInches  \
0     ...                     29.68                     29.59
1     ...                     30.13                     29.87
2     ...                     30.49                     30.41
3     ...                     30.45                      30.3
4     ...                     30.33                     30.27
...   ...                       ...                       ...
1314  ...                     29.97                     29.88
1315  ...                      29.9                     29.81
1316  ...                     29.86                     29.79
1317  ...                     29.91                     29.87
1318  ...                     29.97                     29.91

     VisibilityHighMiles VisibilityAvgMiles VisibilityLowMiles WindHighMPH  \
0                     10                  7                  2          20
1                     10                 10                  5          16
2                     10                 10                 10           8
3                     10                 10                  7          12
4                     10                 10                  7          10
...                  ...                ...                ...         ...
1314                  10                 10                 10          12
1315                  10                 10                 10          14
1316                  10                 10                 10          12
1317                  10                 10                 10          13
1318                  10                 10                 10          12

     WindAvgMPH WindGustMPH PrecipitationSumInches               Events
0             4          31                   0.46  Rain , Thunderstorm
1             6          25                      0
2             3          12                      0
3             4          20                      0
4             2          16                      T
...         ...         ...                    ...                  ...
1314          5          21                      0
1315          5          20                      0
1316          4          17                      0
1317          4          20                      0
1318          4          20                      0

[1319 rows x 21 columns]

In [18]:
print(weather.shape)

(1319, 21)

In [20]:
print(titanic.dtypes)
print()
print(weather.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Date                          object
TempHighF                      int64
TempAvgF                       int64
TempLowF                       int64
DewPointHighF                 object
DewPointAvgF                  object
DewPointLowF                  object
HumidityHighPercent           object
HumidityAvgPercent            object
HumidityLowPercent            object
SeaLevelPressureHighInches    object
SeaLevelPressureAvgInches     object
SeaLevelPressureLowInches     object
VisibilityHighMiles           object
VisibilityAvgMiles            object
VisibilityLowMiles            object
WindHighMPH                   object
WindAvgMPH                    object
WindGustMPH                   object
PrecipitationSumInches        object
Events                        object
dtype: object

In [22]:
print(titanic.index)
print(students.index)
print(weather.index)

RangeIndex(start=0, stop=418, step=1)
Index(['name1', 'name2', 'name3', 'name4'], dtype='object', name='col1')
RangeIndex(start=0, stop=1319, step=1)

In [23]:
print(titanic.columns)
print(weather.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['Date', 'TempHighF', 'TempAvgF', 'TempLowF', 'DewPointHighF',
       'DewPointAvgF', 'DewPointLowF', 'HumidityHighPercent',
       'HumidityAvgPercent', 'HumidityLowPercent',
       'SeaLevelPressureHighInches', 'SeaLevelPressureAvgInches',
       'SeaLevelPressureLowInches', 'VisibilityHighMiles',
       'VisibilityAvgMiles', 'VisibilityLowMiles', 'WindHighMPH', 'WindAvgMPH',
       'WindGustMPH', 'PrecipitationSumInches', 'Events'],
      dtype='object')

In [25]:
print(titanic.values)
print(type(titanic.values))
print(weather.values)

[[892 0 3 ... 7.8292 nan 'Q']
 [893 1 3 ... 7.0 nan 'S']
 [894 0 2 ... 9.6875 nan 'Q']
 ...
 [1307 0 3 ... 7.25 nan 'S']
 [1308 0 3 ... 8.05 nan 'S']
 [1309 0 3 ... 22.3583 nan 'C']]
<class 'numpy.ndarray'>
[['2013-12-21' 74 60 ... '31' '0.46' 'Rain , Thunderstorm']
 ['2013-12-22' 56 48 ... '25' '0' ' ']
 ['2013-12-23' 58 45 ... '12' '0' ' ']
 ...
 ['2017-07-29' 107 92 ... '17' '0' ' ']
 ['2017-07-30' 106 93 ... '20' '0' ' ']
 ['2017-07-31' 99 88 ... '20' '0' ' ']]

In [29]:
print(titanic.head(2))
print()
print(weather.head(2))

   PassengerId  Survived  Pclass                              Name     Sex  \
0          892         0       3                  Kelly, Mr. James    male
1          893         1       3  Wilkes, Mrs. James (Ellen Needs)  female

    Age  SibSp  Parch  Ticket    Fare Cabin Embarked
0  34.5      0      0  330911  7.8292   NaN        Q
1  47.0      1      0  363272  7.0000   NaN        S

         Date  TempHighF  TempAvgF  TempLowF DewPointHighF DewPointAvgF  \
0  2013-12-21         74        60        45            67           49
1  2013-12-22         56        48        39            43           36

  DewPointLowF HumidityHighPercent HumidityAvgPercent HumidityLowPercent  ...  \
0           43                  93                 75                 57  ...
1           28                  93                 68                 43  ...

  SeaLevelPressureAvgInches SeaLevelPressureLowInches VisibilityHighMiles  \
0                     29.68                     29.59                  10
1                     30.13                     29.87                  10

  VisibilityAvgMiles VisibilityLowMiles WindHighMPH WindAvgMPH WindGustMPH  \
0                  7                  2          20          4          31
1                 10                  5          16          6          25

  PrecipitationSumInches               Events
0                   0.46  Rain , Thunderstorm
1                      0

[2 rows x 21 columns]

In [30]:
weather.tail(1)

,Date,TempHighF,TempAvgF,TempLowF,DewPointHighF,DewPointAvgF,DewPointLowF,HumidityHighPercent,HumidityAvgPercent,HumidityLowPercent,...,SeaLevelPressureAvgInches,SeaLevelPressureLowInches,VisibilityHighMiles,VisibilityAvgMiles,VisibilityLowMiles,WindHighMPH,WindAvgMPH,WindGustMPH,PrecipitationSumInches,Events
1318,2017-07-31,99,88,77,66,61,54,64,43,22,...,29.97,29.91,10,10,10,12,4,20,0,

In [38]:
weather.sample()

,Date,TempHighF,TempAvgF,TempLowF,DewPointHighF,DewPointAvgF,DewPointLowF,HumidityHighPercent,HumidityAvgPercent,HumidityLowPercent,...,SeaLevelPressureAvgInches,SeaLevelPressureLowInches,VisibilityHighMiles,VisibilityAvgMiles,VisibilityLowMiles,WindHighMPH,WindAvgMPH,WindGustMPH,PrecipitationSumInches,Events
1017,2016-10-03,87,75,62,64,61,59,90,66,42,...,29.91,29.82,10,10,9,10,3,14,0,

In [39]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [41]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [5]:
import numpy as np
import pandas as pd
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [9]:
print(titanic.duplicated().sum())

0

In [17]:
print(students.duplicated().sum())

0

In [19]:
x=students.rename(columns={'col2':'Python','col3':'C++'},inplace=True)
print(x)
print(students)

None
       Python  C++  col4
col1
name1     100   80    10
name2      90   70     7
name3     120  100    14
name4      80   50     2

In [20]:
students.sum(axis=0)

Python    390
C++       300
col4       33
dtype: int64

In [21]:
students.sum(axis=1)

col1
name1    190
name2    167
name3    234
name4    132
dtype: int64

In [22]:
students.mean(axis=1)

col1
name1    63.333333
name2    55.666667
name3    78.000000
name4    44.000000
dtype: float64

In [23]:
students.std()

Python    17.078251
C++       20.816660
col4       5.057997
dtype: float64

In [25]:
titanic[['PassengerId','Survived','Pclass']]

     PassengerId  Survived  Pclass
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

[418 rows x 3 columns]

In [26]:
weather.columns

Index(['Date', 'TempHighF', 'TempAvgF', 'TempLowF', 'DewPointHighF',
       'DewPointAvgF', 'DewPointLowF', 'HumidityHighPercent',
       'HumidityAvgPercent', 'HumidityLowPercent',
       'SeaLevelPressureHighInches', 'SeaLevelPressureAvgInches',
       'SeaLevelPressureLowInches', 'VisibilityHighMiles',
       'VisibilityAvgMiles', 'VisibilityLowMiles', 'WindHighMPH', 'WindAvgMPH',
       'WindGustMPH', 'PrecipitationSumInches', 'Events'],
      dtype='object')

In [27]:
weather[['Date','TempAvgF','Events']]

            Date  TempAvgF               Events
0     2013-12-21        60  Rain , Thunderstorm
1     2013-12-22        48
2     2013-12-23        45
3     2013-12-24        46
4     2013-12-25        50
...          ...       ...                  ...
1314  2017-07-27        89
1315  2017-07-28        91
1316  2017-07-29        92
1317  2017-07-30        93
1318  2017-07-31        88

[1319 rows x 3 columns]